app/views/wikis/edit.html.erb

SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 102]]
---
            <ul>
            <% @wiki.collaborators.each do |collaborator| %>