app/views/wikis/show.html.erb

SELECT  1 AS one FROM "collaborators" WHERE "collaborators"."wiki_id" = 1 LIMIT ?  [["LIMIT", 1]]
SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 2]]
---
    <hr />
    <% unless @wiki.collaborators.empty? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <li>
                    <%= User.find_by_id(collaborator.user_id).name %>