app/controllers/charges_controller.rb

UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", "2018-06-04 20:14:16.144136"], ["id", 13]]
---
    def create
      # Amount in cents
      @amount = 1500

      customer = Stripe::Customer.create(
        :email => params[:stripeEmail],
        :source  => params[:stripeToken]
      )

      charge = Stripe::Charge.create(
        :customer    => customer.id,
        :amount      => @amount,
        :description => 'Premium Membership',
        :currency    => 'usd'
      )

      current_user.update_attribute(:role, 'premium')