app/controllers/collaborators_controller.rb

    def create
        user = User.find(params[:user_id])
        @wiki = Wiki.find(params[:wiki_id])
        collaborator = Collaborator.new(user: user, wiki: @wiki)
        if collaborator.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 13], ["wiki_id", 101], ["created_at", "2018-07-12 22:51:58.931997"], ["updated_at", "2018-07-12 22:51:58.931997"]]

    def destroy
        user = User.find(params[:user_id])
        @wiki = Wiki.find(params[:wiki_id])
        collaborator = Collaborator.find_by(user: user, wiki: wiki)
        if @collaborator.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 51]]