app/controllers/collaborators_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "premium2@example.com"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(email: params[:collaborator][:user])

SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
---
    def destroy
        collaborator = Collaborator.find(params[:id])