app/controllers/users_controller.rb

  def downgrade
    @wikis = current_user.wikis

    @wikis.unscoped.update_all(private: 'false')
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2018-06-04 14:49:03.127362"], ["id", 13]]
UPDATE "wikis" SET "private" = 'false'