app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis" ORDER BY created_at DESC
---
  def index
    @wiki = Wiki.all

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
  def show
    @wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This is a new wiki"], ["body", "This is a new wiki.\r\n\r\nPow"], ["user_id", 1], ["created_at", "2018-05-27 16:03:11.618476"], ["updated_at", "2018-05-27 16:03:11.618476"]]
---
def create
  @wiki = current_user.wikis.create(wiki_params)

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 98], ["LIMIT", 1]]
---
  def edit
    @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 104], ["LIMIT", 1]]
UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "This is Joe's Wiki"], ["body", "This is Joe's wiki\r\n\r\nThis is Steve's edit\r\n\r\nThis is Steve's second edit"], ["updated_at", "2018-05-31 00:57:21.246549"], ["id", 17]]
---
  def update
    @wiki = Wiki.find(params[:id])
    # @wiki.title = params[:wiki][:title]
    # @wiki.body = params[:wiki][:body]
    authorize @wiki
    @wiki.assign_attributes(wiki_params)

    if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 99], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]
---
  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki

    if @wiki.destroy