app/controllers/wikis_controller.rb

  def show
    @wiki = Wiki.find(params[:id])
    @users = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]